In [16]:
import pandas as pd
import numpy as np

data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', 'blue', 'yellow', 'pink', 'black', 'green', 'red']
})
data
"""
How to select the column city ?
"""

'\nHow to select the column city ?\n'

In [17]:
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F            blue
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M            pink
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [18]:
data["city"]

0    Gurgaon
1      Delhi
2     Mumbai
3      Delhi
4     Mumbai
5      Delhi
6     Mumbai
Name: city, dtype: object

In [19]:
data[["city"]]

      city
0  Gurgaon
1    Delhi
2   Mumbai
3    Delhi
4   Mumbai
5    Delhi
6   Mumbai

In [11]:
"""
The DataFrame data has already been created above. How can you remove the row 6  permanently?
"""

'\nThe DataFrame data has already been created above. How can you remove the row 6  permanently?\n'

In [20]:
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F            blue
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M            pink
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [21]:
# solution 1
data.drop(index=5, inplace=True)
# solution 2
data.drop(6, axis=0, inplace=True)
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F            blue
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M            pink
4   12       B   Mumbai      M           black
6   17       A   Mumbai      F             red

In [23]:
"""The DataFrame data has already been created above. How to select the row B with iloc method as below?
age                   22
city               Delhi
gender                 F
favourite_color     blue
"""

'The DataFrame data has already been created above. How to select the row B with iloc method as below?\nage                   22\ncity               Delhi\ngender                 F\nfavourite_color     blue\n'

In [24]:
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F            blue
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M            pink
4   12       B   Mumbai      M           black
6   17       A   Mumbai      F             red

In [27]:
data.iloc[1]

age                   22
section                B
city               Delhi
gender                 F
favourite_color     blue
Name: 1, dtype: object

In [28]:
data.iloc[[1]]

   age section   city gender favourite_color
1   22       B  Delhi      F            blue

In [ ]:
"""
The DataFrame data has already been created above. How to select the rows 1 and 6 together with columns city and gender with loc method as below?
	    city	gender
1	    Delhi	F
6	    Mumbai	F
"""

In [30]:
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F            blue
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M            pink
4   12       B   Mumbai      M           black
6   17       A   Mumbai      F             red

In [36]:
data.loc[[1,6], ["city", "gender"]]

     city gender
1   Delhi      F
6  Mumbai      F

In [ ]:
"""
The DataFrame data has already been created above. How to select the rows 3 and 4 together with  columns city and gender with iloc method as below?
		city	gender		
3		Delhi	M
4		Mumbai	M
"""

In [37]:
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F            blue
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M            pink
4   12       B   Mumbai      M           black
6   17       A   Mumbai      F             red

In [41]:
# solution 1
data.iloc[3:5, 2:4]

     city gender
3   Delhi      M
4  Mumbai      M

In [45]:
# solution 2
data.iloc[[3,4], [2,3]]

     city gender
3   Delhi      M
4  Mumbai      M